<template>
    <table-comp 
        v-if="this.winW > 500"
        @p1="scrollTo('p1')"
        @p2="scrollTo('p2')"
        @p3="scrollTo('p3')"
        @p4="scrollTo('p4')"
        @p5="scrollTo('p5')"
        @p6="scrollTo('p6')"
        @p7="scrollTo('p7')"
        @p8="scrollTo('p8')"
    />
    <div class="box">
        <div ref="p1">
            <h2>Определение экспертных систем</h2>
            <p>Экспертная система (далее по тексту — ЭС) — это информационная система, назначение которой частично или полностью заменить эксперта в той или иной предметной области. </p>
            <p>Подобные интеллектуальные системы эффективно применяются в таких областях, как логистика, управление воздушными полетами, управление театром военных действий. Основною направленной деятельностью предсказание, прогнозирование в рамках определенного аспекта в предметной области.</p>
        </div>
        <div ref="p2">
            <h2>История создания</h2>
            <p>История экспертных систем берет свое начало в 1965 году. Брюс Бучанан и Эдвард Фейгенбаум начали работу над созданием информационной системы для определения структуры химических соединений.</p>
            <p>Результатом работы была система под названием Dendral. В основе системы формировалась последовательность правил подобных к «IF – THEN». Информационная система не перестала развиваться и получила множество наследников, таких как ONCOIN – информационная система для диагностики раковых заболеваний, MYCIN – информационная система для диагностики легочных инфекционных заболеваний.</p>
            <p>Следующим этапом стали 70-е годы. Период не выделялся особыми разработками. Было создано множество разных прототипов системы Dendral. Примером служит система PROSPECTOR, областью деятельности которой являлась геологические ископаемые и их разведка.</p>
            <p>С 90-ых годов развитие интеллектуальных систем приобретает новые и новые методы и особенности. Нововведением становится парадигма проектирования эффективных и перспективных систем. Гибкость, четкость решения поставленных задач дало новое название – мультиагентных систем. Агент – фоновый процесс который действует в целях пользователя. Каждый агент имеет свою цель, «разум» и отвечает за свою область деятельности. Все агенты в совокупности образуют некий интеллект. Агенты вступают в конкуренцию, настраивают отношения, кооперируются, все как у людей.</p>
        </div>
        <div ref="p3">
            <h2>Современные экспертные системы</h2>
            <p>В 21 век, интеллектуальной системой уже не удивишь никого. Множество фирм внедряет экспертные системы в области своей деятельности.</p>
            <p>Быстродействующая система OMEGAMON разрабатывается c 2004 года с IBM, цель которой отслеживание состояния корпоративной информационной сети. Служит для моментального принятия решений в критических или неблагоприятных ситуациях.</p>
            <p>G2 – экспертная система от фирмы Gensym, направленная на работу с динамическими объектами. Особенность этой системы состоит в том, что в нее внедрили распараллеливание процессов мышления, что делает ее быстрее и эффективней.</p>
        </div>
        <div ref="p4">
            <h2>Структура экспертной системы</h2>
            <h3>1. База знаний</h3>
            <p>Знания — это правила, законы, закономерности получены в результате профессиональной деятельности в пределах предметной области.</p>
            <p>База знаний — база данных содержащая правила вывода и информацию о человеческом опыте и знаниях в некоторой предметной области. Другими словами, это набор таких закономерностей, которые устанавливают связи между вводимой и выводимой информацией.</p>
            <h3>2. Данные</h3>
            <p>Данные — это совокупность фактов и идей представленных в формализованном виде. Собственно на данных основываются закономерности для предсказания, прогнозирования. Продвинутые интеллектуальные системы способные учиться на основе этих данных, добавляя новые знания в базу знаний.</p>
            <h3>3. Модель представления данных</h3>
            <p>Самая интересная часть экспертной системы. Модель представления знаний (далее по тексту — МПЗ) — это способ задания знаний для хранения, удобного доступа и взаимодействия с ними, который подходит под задачу интеллектуальной системы.</p>
            <h3>4. Механизм логического вывода данных (Подсистема вывода)</h3>
            <p>Механизм логического вывода(далее по тексту — МЛВ) данных выполняет анализ и проделывает работу по получению новых знаний исходя из сопоставления исходных данных из базы данных и правил из базы знаний. Механизм логического вывода в структуре интеллектуальной системы занимает наиболее важное место.</p>
            <p>Механизм логического вывода данных концептуально можно представить в виде A,B,C,D: <br/>А — функция выбора из базы знаний и из базы данных закономерностей и фактов соответственно. <br/>B — функция проверки правил, результатом которой определяется множество фактов из базы данных к которым применимы правила. <br/>С — функция, которая определяет порядок применения правил, если в результате правила указаны одинаковые факты. <br/>D — функция, которая применяет действие.</p>
        </div>
        <div ref="p5">
            <h2>Эксперты и экспертные системы</h2>
            <p>Экспертные системы — это сложные программные комплексы, аккумулирующие знания специалистов в конкретных предметных областях и дающие к ним доступ менее квалифицированным специалистам. От квалификации экспертов и правильно спроектированной базы знаний на 90% зависит качество ЭС.
                Информацию для экспертных систем надо получить у экспертов, а потом формализовать. Решением задач по «извлечению» знаний и их формализации для введения в базы знаний занялись специальные «инженеры по знаниям».
                Которые столкнулись со вполне понятной проблемой — поскольку эксперты понимали, что пользуясь созданной с их помощью ЭС специалист более низкой квалификации получит знания, которые сами эксперты добывали годами упорного труда, то у них часто отсутствовало желания делиться информацией. Кроме того, часто достаточно трудно формализовать его экспертные знания.
            </p>
            <p>Конечно, БЗ часто, особенно в медицине, формировались по печатным источникам, но в целом это снижало качество выдаваемых рекомендаций.
                Также тормозит развитие ЭС трудоемкая работа по ручному пополнению баз знаний
            </p>
            <p>Поэтому еще в 70-е годы была поставлена задача по их автоматическому извлечению из различных источников — статей, книг и интернет-публикаций. Однако сбор таких данных до конца проблемы с получением знаний непосредственно от экспертов не решает.</p>
        </div>
        <div ref="p6">
            <h2>Искусственный интеллект и Экспертные системы</h2>
            <p>В настоящее время экспертные системы применяются достаточно широко, но совершенно без всякого ажиотажа вокруг них. Наиболее популярные области применения ЭС — системы диагностики и ремонта оборудования, проектирования, планирования, составления расписаний, поддержки принятия решений, свою экспертную систему содержит внутри почти любая серьезная компьютерная игра.</p>
            <p>В технологическом плане наиболее существенный процесс в жизни экспертных систем — их объединение с системами искусственного интеллекта на основе нейросетей</p>
            <p>В таких гибридных системах вместо всей или части базы знаний используется обученная нейронная сеть. Это дает возможность экспертной системе оперировать неполными и недостоверными знаниями, а также быть устойчивой к зашумленным данным. Используются в ЭС и другие современные технологии — облачные, обработки больших данных, Data Mining (для формирования БЗ). Есть попытки создать самообучаемые ЭС.</p>
        </div>
        <div ref="p7">
            <h2>Применение экспертных систем</h2>
            <p>В настоящее время экспертные системы применяются достаточно широко, но совершенно без всякого ажиотажа вокруг них. Наиболее популярные области применения ЭС — системы диагностики и ремонта оборудования, проектирования, планирования, составления расписаний, поддержки принятия решений, свою экспертную систему содержит внутри почти любая серьезная компьютерная игра.</p>
            <p>Системы используются для установления связи между нарушениями деятельности организма и их возможными причинами. Наиболее известна диагностическая система MYCIN, которая предназначена для диагностики и наблюдения </p>
            <h3>Медицинская диагностика</h3>
            <p>Диагностические за состоянием больного при менингите и бактериальных инфекциях. Ее первая версия была разработана в Стенфордском университете в середине 70-х годов. В настоящее время эта система ставит диагноз на уровне врача-специалиста. Она имеет расширенную базу знаний, благодаря чему может применяться и в других областях медицины.</p>
            <h3>Прогнозирование</h3>
            <p>Прогнозирующие системы предсказывают возможные результаты или события на основе данных о текущем состоянии объекта. Программная система "Завоевание Уолл-стрита" может проанализировать конъюнктуру рынка и с помощью статистических методов алгоритмов разработать для вас план капиталовложений на перспективу</p>
            <p>Она не относится к числу систем, основанных на знаниях, поскольку использует процедуры и алгоритмы традиционного программирования. Хотя пока еще отсутствуют ЭС, которые способны за счет своей информации о конъюнктуре рынка помочь вам увеличить капитал, прогнозирующие системы уже сегодня могут предсказывать погоду, урожайность и поток пассажиров. Даже на персональном компьютере, установив простую систему, основанную на знаниях, вы можете получить местный прогноз погоды.</p>
            <h3>Планирование</h3>
            <p>Планирующие системы предназначены для достижения конкретных целей при решении задач с большим числом переменных. Дамасская фирма Informat впервые в торговой практике предоставляет в распоряжении покупателей 13 рабочих станций, установленных в холле своего офиса, на которых проводятся бесплатные 15-минутные консультации с целью помочь покупателям выбрать компьютер, в наибольшей степени отвечающий их потребностям и бюджету. Кроме того, компания Boeing применяет ЭС для проектирования космических станций, а также для выявления причин отказов самолетных двигателей и ремонта вертолетов. Экспертная система XCON, созданная фирмой DEC, служит для определения или изменения конфигурации компьютерных систем типа VAX и в соответствии с требованиями покупателя. Фирма DEC разрабатывает более мощную систему XSEL, включающую базу знаний системы XCON, с целью оказания помощи покупателям при выборе вычислительных систем с нужной конфигурацией. В отличие от XCON система XSEL является интерактивной.</p>
            <h3>Интерпретация</h3>
            <p>Интерпретирующие системы обладают способностью получать определенные заключения на основе результатов наблюдения. Система PROSPECTOR, одна из наиболее известных систем интерпретирующего типа, объединяет знания девяти экспертов. Используя сочетания девяти методов экспертизы, системе удалось обнаружить залежи руды стоимостью в миллион долларов, причем наличие этих залежей не предполагал ни один из девяти экспертов. Другая интерпретирующая система- HASP/SIAP. Она определяет местоположение и типы судов в тихом океане по данным акустических систем слежения.</p>
            <h3>Контроль и управление</h3>
            <p>Системы, основанные на знаниях, могут применятся в качестве интеллектуальных систем контроля и принимать решения, анализируя данные, поступающие от нескольких источников. </p>
            <p>Такие системы уже работают на атомных электростанциях, управляют воздушным движением и осуществляют медицинский контроль. Они могут быть также полезны при регулировании финансовой деятельности предприятия и оказывать помощь при выработке решений в критических ситуациях.</p>
            <h3>Диагностика неисправностей в механических и электрических устройствах.</h3>
            <p>В этой сфере системы, основанные на знаниях, незаменимы как при ремонте механических и электрических машин (автомобилей, дизельных локомотивов и т.д.), так и при устранении неисправностей и ошибок в аппаратном и программном обеспечении компьютеров.</p>
            <h3>Обучение</h3>
            <p>Системы, основанные на знаниях, могут входить составной частью в компьютерные системы обучения. Система получает информацию о деятельности некоторого объекта (например, студента) и анализирует его поведение. База знаний изменяется в соответствии с поведением объекта. Примером этого обучения может служить компьютерная игра, сложность которой увеличивается по мере возрастания степени квалификации играющего. Одной из наиболее интересных обучающих ЭС является разработанная Д.Ленатом система EURISCO, которая использует простые эвристики. Эта система была опробована в игре Т.Тревевеллера, имитирующая боевые действия. Суть игры состоит в том, чтобы определить состав флотилии, способной нанести поражение в условиях неизменяемого множества правил. Система EURISCO включила в состав флотилии небольшие, способные провести быструю атаку корабли и одно очень маленькое скоростное судно и постоянно выигрывала в течение трех лет, несмотря на то, что в стремлении воспрепятствовать этому правила игры меняли каждый год.</p>
            <br/>
            <p>Большинство ЭС включают знания, по содержанию которых их можно отнести одновременно к нескольким типам. Например, обучающая система может также обладать знаниями, позволяющими выполнять диагностику и планирование. </p>
            <p>Она определяет способности обучаемого по основным направлениям курса, а затем с учетом полученных данных составляет учебный план. Управляющая система может применяться для целей контроля, диагностики, прогнозирования и планирования. Система, обеспечивающая сохранность жилища, может следить за окружающей обстановкой, распознавать происходящие события (например, открылось окно), выдавать прогноз (вор-взломщик намеревается проникнуть в дом) и составлять план действий (вызвать полицию).</p>
        </div>
        <div ref="p8">
            <h2>Заключение</h2>
            <p>Экспертные системы действительно имеют широкое применение в нашей жизни. Они позволяют экономить время реальных экспертов в определенной предметной области. Модели представления знаний это неотъемлемая часть интеллектуальных систем любого уровня. Поэтому, я считаю, что каждый уважающий себя IT-специалист, должен иметь даже поверхностные знания в этих областях.</p>
        </div>
    </div>
</template>

<script>
import tableComp from "@/components/tableComp.vue"
export default{
    name:"textComp",
    components: {
        tableComp
    },
    data() {
        return {
            winW: Number,
        }
    },
    methods: {
        scrollTo(refName) {
            var element = this.$refs[refName];
            var top = element.offsetTop;
            window.scrollTo(0, top - 100);
        },
        resizeHandler() {
            this.winW = window.innerWidth;
        }
    },
    mounted() {
        this.winW = window.innerWidth;
    },
    created() {
        window.addEventListener("resize", this.resizeHandler)
    },
    unmounted() {
        window.removeEventListener("resize", this.resizeHandler)
    }
}
</script>

<style>
.box
{
border: 3px solid black;
border-radius: 25px;
padding: 20px;
background-color: white;
width: fit-content;
margin-left: 10vw;
margin-top: 100px;
margin-right: 3vw;
}

</style>